{
  "_name_or_path": "google/mobilenet_v2_1.0_224",
  "architectures": [
    "MobileNetV2ForImageClassification"
  ],
  "classifier_dropout_prob": 0.2,
  "depth_divisible_by": 8,
  "depth_multiplier": 1.0,
  "expand_ratio": 6,
  "finegrained_output": true,
  "first_layer_is_expansion": true,
  "hidden_act": "relu6",
  "id2label": {
    "0": "beignets",
    "1": "bruschetta",
    "2": "chicken_wings",
    "3": "hamburger",
    "4": "pork_chop",
    "5": "prime_rib",
    "6": "ramen"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "beignets": 0,
    "bruschetta": 1,
    "chicken_wings": 2,
    "hamburger": 3,
    "pork_chop": 4,
    "prime_rib": 5,
    "ramen": 6
  },
  "layer_norm_eps": 0.001,
  "min_depth": 8,
  "model_type": "mobilenet_v2",
  "num_channels": 3,
  "output_stride": 32,
  "problem_type": "single_label_classification",
  "semantic_loss_ignore_index": 255,
  "tf_padding": true,
  "torch_dtype": "float32",
  "transformers_version": "4.35.2"
}
